package day0126;

/*
Q. 오늘 공부하신 내용 보시면서 복습겸 JDBC연습해 보세요

 시퀀스: seq_info
테이블명: stuinfo (학생정보)

    시퀀스 : s_no  : 정수형  기본키
    학생명: s_name 문자열
    성별: s_gender  문자열
    나이: s_age  정수
    연락처: s_hp  문자열
    가입일:  gaipday  :날짜형  현재날짜 들어가게…

==================================================
클래스명:  QuizStuInfo

메인에서 처리할것
1.학생정보입력  2.정보출력   3.정보삭제    4.학생정보 수정   5.학생검색   9.종료


1.학생정보입력시

학생명?
성별?
나이?
연락처? 
콘솙창에 각각 입력하여 insert확인한다

아직 조회는 안되므로 db로 가서 확인할것!!!!

2. 학생전체정보 출력

db와 동일하게 테이블 형태로 출력할것!!!

3.정보삭제

삭제할 시퀀스는?
 번호를 쓰면 삭제됨 표시되게 할것
조회시 삭제되었는지 확인

4. 정보수정
수정할 시퀀스는?
시퀀스 존재시  학생명,성별,나이 ,연락처 수정하도록 하세요

5. 학생검색

이 라고 쓰면  이수연,이영자 등등이 검색됩니다
영자 라고 쓰면  이영자  김영자 신영자 등등의 정보가 검색됩니다

즉 입력한글이 포함되도록 검색해보세요
검색해서 2번같은 모양이 되면 됩니다


*/

public class L03_HomeWork {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
